"use strict";

/*
Создать переменные positive и negative, в которые пользователь вводит с 
клавиатуры значения. Нужно попросить пользователя ввести положительное число в 
переменную positive и отрицательное в переменную negative. 
Перед тем, как положить значения в данные переменные необходимо их превратить 
в числа.
После ввода значений, необходимо вывести "Все значения верные.", если 
пользователь действительно ввел корректные значения, которые мы просили его 
ввести.
Если же пользователь где-то ввел неверное значение, то необходимо вывести 
в консоль "Одно или более значений некорректно.".
*/
// function inputValidation(num1, num2) {

//     if (Number.isNaN(+num1) || Number.isNaN(+num2)) {
//         alert('Одно или более значений некорректно');
//     } else if (num1.trim() === "" || num2.trim() === "") {
//         alert('Одно или более значений некорректно');
//     } else if (Number(num1) >= 0 && Number(num2) < 0) {
//         alert('Все значения верные');
//     }
// }

// const positive = prompt('Введите положительное число: ');
// const negative = prompt('Введите отрицательное число: ');
// inputValidation(positive, negative);


